[{"code":"ITMD 321","title":"Data Modeling and Applications","description":"Basic data modeling concepts are introduced. Hands-on database design, implementation, and administration of single-user and shared multi-user database applications using a contemporary relational database management system.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 361","title":"Fundamentals of Web Development","description":"This course will cover the creation of Web pages and sites using HTML, CSS, Javascript, jQuery, and graphical applications as well as the client and server architecture of the Internet and related web technologies. The creation and deployment of modern, standards-compliant web pages are addressed. Students create and deploy a Web site with multiple pages and cross-linked structures.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 362","title":"Human-Computer Interaction and Web Design","description":"Students in this course will learn the importance of human-computer interaction design and the effectiveness of user-centered design. The course will cover a survey of methods frequently used by the HCI profession, such as usability testing and prototyping, as well as general design principles and how to use design guidelines. A particular emphasis will be placed on usability for Web site engineering, and students will apply knowledge from the field in the design and construction of user-centered Web sites.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 411","title":"Intermediate Software Development","description":"This course covers a broad spectrum of object-oriented programming concepts and application programming interfaces. The student considers the details of object-orientated development in topics of multi-threading, data structure collections, stream I/O and client interfaces. Software engineering topics of packaging and deployment are covered as well. Hands-on exercises reinforce concepts taught throughout the course.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 412","title":"Advanced Structured and Systems Programming","description":"Structured programming continues with advanced concepts including strings, arrays, pointers, data structures, file manipulation, and dynamic memory management. Students create more complex applications that work with user input, manipulate user supplied text or text obtained from a file, apply standard library routines for working with literal text, use pointers to store complex structures within arrays, and read and write data from files, the console, and the terminal. The object-oriented programming (OOP) paradigm is covered in depth including the philosophy of OOP, classes and objects, inheritance, template classes, and making use of class libraries.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 413","title":"Open Source Programming","description":"Contemporary open-source programming languages and frameworks are presented. The student considers design and development topics in system, graphical user interface, network, and web programming. Dynamic scripting languages are covered using object-oriented, concurrent, and functional programming paradigms. Concepts gained throughout the course are reinforced with numerous exercises which will culminate in an open-source programming project.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 415","title":"Advanced Software Development","description":"This course considers Web container application development for enterprise systems. The primary focus is on database connectivity (JDBC) integration with Web application programming using an enterprise-level application framework. A Web application term project considers the design and implementation of a database instance that serves as the information tier in a contemporary 3-tier enterprise solution.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 419","title":"Topics in Software Development","description":"This course will cover a particular topic in software development, varying from semester to semester, in which there is particular student or staff interest. This course may be taken more than once but only 9 hours of ITMD 419/519 credit may be applied to a degree.","hours":{"credit":"variable"}},{"code":"ITMD 422","title":"Advanced Database Management","description":"Advanced topics in database management and programming including client server application development are introduced. Expands knowledge of data modeling concepts and introduces object-oriented data modeling techniques. Students will learn the use of Structured Query Language in a variety of application and operating system environments.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 453","title":"Enterprise Intelligent Device Applications","description":"Intelligent device application development is covered with proprietary enterprise and open-source technologies on media device, mobile, and robotic platforms. Utilizing contemporary toolkits, the student considers design and development on simulated and real \"smart\" devices including smart phones, tablets, sensors, actuators, drones, and robots. Numerous exercises reinforce concepts gained throughout the course. A term project will integrate course topics into a comprehensive intelligent device application.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 454","title":"Mass-Market Intelligent Device Applications","description":"Intelligent device application development is covered with leading mass-market and open-source technologies on media device, mobile, and robotic platforms. Utilizing contemporary toolkits, the student considers design and development on simulated and real \"smart\" devices including smart phones, tablets, sensors, actuators, drones, and robots. Numerous exercises reinforce concepts gained throughout the course. A term project will integrate course topics into a comprehensive intelligent device application.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 455","title":"Open-Source Intelligent Device Applications","description":"Intelligent device application development is covered with various technologies on mobile and robotic platforms. Utilizing contemporary toolkits, the student considers design and development on emulated and real \"smart\" devices including smart phones, personal digital assistants, sensors, actuators, and robots. Numerous exercises reinforce concepts gained throughout the course. A term project will integrate course topics into a comprehensive intelligent device application.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 460","title":"Fundamentals of Multimedia","description":"Students are introduced to computer-based multimedia theory, concepts, and applications. Topics include desktop publishing, hypermedia, presentation graphics, graphic images, animation, sound, video, multimedia on the World Wide Web and integrated multimedia authoring techniques.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 462","title":"Web Site Application Development","description":"This course is designed to primarily introduce PHP as a server-side programming language for building dynamic web pages and applications. Topics covered include PHP language syntax and usage, handling form data, current libraries and frameworks, web application security, development tools, application architecture, and database access. Other languages for server-side web development and the use of content management systems may be discussed. Students will design and create a web application that will allow for user login pages as well as functionality to create, read, update, and delete database content through a web interface using web forms and basic database structure.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 463","title":"Intermediate Web Application Development","description":"In-depth examination of the concepts involved in the development of Internet applications. Students will learn the differences and similarities between Internet applications and traditional client/server applications. A discussion of the technologies involved in creating these Internet applications is included, and students will learn to use these technologies to create robust server-side applications.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 464","title":"Advanced Web Application Development","description":"Strategies for management of electronic commerce allow students to learn to re-engineer established business processes to increase enterprise competitive advantage, provide better customer service, reduce operating costs, and achieve a better return on investment. Students will learn to evaluate, use, and deploy state-of-the-art tools and techniques needed to develop a reliable e-commerce offering on the Web. The course will cover state-of-the-art programming and development tools. This class will provide students with hands-on exposure needed to design and build a fully functional e-commerce Web site.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 465","title":"Rich Internet Applications","description":"Students learn to create interactive rich Internet applications using modern web development technologies, frameworks, and techniques to deliver robust applications that primarily operate on the client-side. The emphasis will be on developing client-side programs that run in a standards-based web browser without plugins. Some server and command line coding will also be explored. Topics covered may include the JavaScript language, HTML5 APIs, the Document Object Model (DOM), JavaScript libraries and frameworks, development tools, application architecture, and compile-to-JS languages.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 466","title":"Service-Oriented Architecture","description":"This course covers IT enterprise systems employing web services technologies in SOA and ESB architectural patterns. The student considers SOA which defines and provisions IT infrastructure and allows for a loosely-coupled data exchange over disparate applications participating in business processes. The simplification of integration and flexible reuse of business components within SOA is greatly furthered by ESB. Lab exercises using contemporary tool-kits are utilized to reinforce platform-agnostic course topics.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 467","title":"Web Systems Integration","description":"In this project-based course, student teams will build an enterprise-grade website and web infrastructure integrating server-side applications, databases, and client-side rich internet applications as a solution to a defined business problem.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 469","title":"Topics in Application Development","description":"This course will cover a particular topic in application development, varying from semester to semester, in which there is particular student or staff interest. This course may be taken more than once but only 9 hours of ITMD 469/569 credit may be applied to a degree.","hours":{"credit":"variable"}},{"code":"ITMD 510","title":"Object-Oriented Application Development","description":"This course covers a broad spectrum of object-oriented programming concepts and application programming interfaces. The student considers the details of object-oriented development in topics of multi-threading, data structure collections, stream I/O and clientinterfaces. Software engineering topics of packaging and deployment are covered as well. Strong emphasis is placed on the creation of applications providing solutions for defined business problems. Hands-on exercises reinforce concepts taught throughout the course.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 511","title":"Application Development Methodologies","description":"Students learn concepts in a systematic approach to the analysis, design, implementation and maintenance of software. Includes studies of the various models of the software life-cycle, software development project management, system requirements analysis, and methodologies for practical application of these models to software development, including the use of CASE (Computer Aided Software Engineering) tools. Students apply these principles in projects to improve the quality of their development process and final products.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 512","title":"Structured and Systems Programming","description":"Structured programming with advanced concepts including strings, arrays, pointers, data structures, file manipulation, and dynamic memory management. Students create complex applications that work with user input, manipulate user supplied text or text obtained from a file, apply standard library routines for working with literal text, use pointers to store complex structures within arrays, and read and write data from files, the console, and the terminal. The object-oriented programming (OOP) paradigm is covered in depth including the philosophy of OOP, classes and objects, inheritance, template classes, and making use of class libraries. Strong emphasis is placed on the creation of applications providing solutions for defined business problems or specific operating system issues.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 513","title":"Open Source Programming","description":"Contemporary open-source programming languages and frameworks are presented. The student considers design and development topics in system, graphical user interface, network and web programming. Dynamic scripting languages are covered using object-oriented, concurrent and functional programming paradigms. Concepts gained throughout the course are reinforced with numerous exercises which will culminate in an open-source programming project.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 514","title":"Programming for Data Analytics","description":"This course will introduce essential programming concepts and techniques used in analytics. Students will learn and make use of industry standard programming languages widely used in application programming for data and statistical analysis as well as other purposes. Students will understand and use various libraries for data manipulation, preparation, and analysis, and will be equipped to use the programming languages covered in real world scenarios and circumstances upon completion.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 515","title":"Advanced Software Programming","description":"This course considers Web container application development for enterprise systems. The primary focus is on database connectivity (JDBC) integration with Web application programming using an enterprise-level application framework. A Web application term project considers the design and implementation of a database instance that serves as the information tier in a contemporary 3-tier enterprise solution.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 519","title":"Topics in Software Development","description":"This course will cover a particular topic in software development varying from semester to semester in which there is particular student or staff interest. The course may be taken more than once but only 9 hours of ITMD 419/519 credit may be applied to a degree.","hours":{"credit":"variable"}},{"code":"ITMD 521","title":"Client/Server Technologies and Applications","description":"This course covers both concepts and practical applications of distributed data paradigms. This provides a comparison between SQL and MapReduce. The course focuses on how to treat and prepare unstructured data to be used in the MapReduce framework in a parallel fashion. Students will be tasked with learning and demonstrating the MapReduce framework through implementing the Hadoop framework and associated Java technology.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 523","title":"Advanced Topics in Data Management","description":"Advanced topics in database management and programming including client server application development are introduced. Students will learn the use of Structured Query Language in a variety of application and operating system environments. Expands knowledge of data modeling concepts and introduces object-oriented data modeling techniques with specific attention to the use of database management systems in response to defined business problems.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 525","title":"Topics in Data Science and Management","description":"This course will cover a particular topic in databases, data science, data management, or data analytics, varying from semester to semester, in which there is particular student or staff interest.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 526","title":"Data Warehousing","description":"This class will introduce the student to concepts needed for successfully designing, building and implementing a data warehouse. The class will provide the technological and managerial knowledge base for data modeling approaches such as the star schema and database de-normalization issues. Topics such as loading the warehouse, performance considerations, and other concepts unique to the data warehouse environment will be discussed demonstrated in detail.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 527","title":"Data Analytics","description":"This is a hands-on course that focuses on the creation, maintenance, and analysis of large informatics databases. Concepts such as data modeling, probability, linear regression, and statistical data analysis are covered in depth. In addition, this course will use large simulated equities, healthcare, insurance, and banking database systems. The student is expected to have a working understanding of relational database concepts as well as SQL.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 529","title":"Advanced Data Analytics","description":"Informatics is the application of information technology to solve problems in other fields. Informaticists use technology and information to build intelligent systems used to bridge the gaps between information, technology, and the people who use it. The study of informatics is about blending applied mathematics with technology while understanding the broader consequences of computing on society and the problem being solved. It is important for any student to develop a broad perspective of technology and the people it serves. This course builds upon the student's knowledge of mathematical concepts of predictive modeling of samples and populations with an emphasis on applying technology to solve real world problems.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 532","title":"UML-Based Software Development","description":"Study of software development using the Unified Modeling Language (UML). Covers architecture-driven and component based techniques for modeling object-oriented applications. Particular emphasis is placed on the hands on application of tools and components used for object oriented systems modeling.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 534","title":"Human and Computer Interaction","description":"Introduction to human-computer interaction, a discipline concerned with the design, evaluation and implementation of interactive computing systems for human use. Emphasis is given to the structure of communication between people and computers, capabilities of people to use computers, concerns that arise in designing and building interfaces, design trade-offs, and the process of specification, design, and implementation of user interfaces. Particular emphasis is placed on practical design and usability of computer system user interfaces.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 535","title":"Human-Computer Interaction Design","description":"Advanced study in human-computer interaction with a particular focus on the design of application and web interfaces.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 536","title":"Software Testing and Maintenance","description":"This course covers the basic concepts of software testing and maintenance. The Testing Maturity Model provides a framework for developing a more mature test process. Testing techniques, test metrics and test plan management concepts are described within this framework.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 545","title":"Web Real-Time Communications","description":"This course covers a set of protocols, architectures, and APIs designed to enable browser-to-browser real-time communication of voice, video, and data. Students will learn to apply basic technologies including WebSockets, HTTP, HTML5, Web Sockets, NAT, STUN, TURN, and ICE to ensure two-way real-time communication is established using the WebRTC API's and architectures. Students will use JavaScript and development environments to create basic data and media applications based on the WebRTC technologies and will record the impact of their applications on the performance and behavior of the networks that carry them.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 553","title":"Enterprise Intelligent Device Applications","description":"Intelligent device application development is covered with proprietary enterprise and open-source technologies on media device, mobile, and robotic platforms. Utilizing contemporary toolkits, the student considers design and development on simulated and real \"smart\" devices including smart phones, tablets, sensors, actuators, drones, and robots. Numerous exercises reinforce concepts gained throughout the course. A term project will integrate course topics into a comprehensive intelligent device application.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 554","title":"Mass-Market Intelligent Device Applications","description":"Intelligent device application development is covered with leading mass-market and open-source technologies on media device, mobile, and robotic platforms. Utilizing contemporary toolkits, the student considers design and development on simulated and real \"smart\" devices including smart phones, tablets, sensors, actuators, drones, and robots. Numerous exercises reinforce concepts gained throughout the course. A term project will integrate course topics into a comprehensive intelligent device application.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 555","title":"Open-Source Intelligent Device Applications","description":"Intelligent device application development is covered with various technologies on mobile and robotic platforms. Utilizing contemporary toolkits, the student considers design and development on emulated and real \"smart\" devices including smart phones, personal digital assistants, sensors, actuators, and robots. Numerous exercises reinforce concepts gained throughout the course. A term project will integrate course topics into a comprehensive intelligent device application.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 556","title":"Intelligent Device Projects","description":"Students create projects that exercise and expand their understanding of intelligent device application development. Instructional materials and lectures are provided as needed to support projects. Scope and deliverables will be determined through joint decision of the instructor and students. Students will describe requirements, create test plans as needed, demonstrate the application when applicable, create a written description of the work, and may deliver a formal presentation to an audience appropriate to the scope and scale of the work completed. This course may be taken more than once but only 6 hours of ITMD 556 credit may be applied to a degree.","hours":{"lecture":2,"lab":2,"credits":3}},{"code":"ITMD 562","title":"Web Site Application Development","description":"Programming the Common Gateway Interface (CGI) for Web pages is introduced with emphasis on creation of interfaces to handle HTML form data. CGI programming is taught in multiple languages. Security of Web sites is covered with an emphasis on controlled access sites. Setup, administration and customization of content management systems including blog and portal sites is introduced. Students design and create a Web site including basic CGI programs with Web interfaces and process data flows from online forms with basic database structures.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 563","title":"Intermediate Web Application Development","description":"In-depth examination of the concepts involved in the development of Internet applications. Students will learn the differences and similarities between Internet applications and traditional client/server applications. A discussion of the technologies involved in creating these Internet applications is included, and students will learn to use these technologies to create robust server-side applications.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 564","title":"Advanced Web Application Development","description":"Strategies for management of electronic commerce allow students to learn to re-engineering established business processes to increase enterprise competitive advantage, provide better customer service, reduce operating costs, and achieve a better return on investment. Students will learn to evaluate, use, and deploy state-of-the-art tools and techniques needed to develop a reliable e-commerce offering on the Web. The course will cover state-of-the-art programming and development tools. This class will provide students with hands-on exposure needed to design and build a fully functional e-commerce Web site.","hours":{"lecture":2,"lab":2,"credits":3}},{"code":"ITMD 565","title":"Rich Internet Applications","description":"Students learn to create interactive rich Internet applications using Web development frameworks, applications, and techniques that primarily operate on the client-side. These applications often exhibit the same characteristics as desktop applications and are typically delivered through a standards-based Web browser, via a browser plug-in, or independently via sandboxes or virtual machines. Current software frameworks used to download, update, verify and execute these applications are addressed as well as writing applications for deployment in these frameworks.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 566","title":"Service-Oriented Architectures","description":"This course covers IT enterprise systems employing web services technologies in SOA and ESB architectural patterns. The student considers SOA which defines and provisions IT infrastructure and allows for a loosely-coupled data exchange over disparate applications participating in business processes. The simplification of integration and flexible reuse of business components within SOA is greatly furthered by ESB. Lab exercises using contemporary toolkits are utilized to reinforce platform-agnostic course topics.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 567","title":"Web Systems Integration","description":"In this project-based course, student teams will build an enterprise-grade website and web infrastructure integrating server-side applications, databases, and client-side rich internet applications as a solution to a defined business problem.","hours":{"lecture":3,"lab":0,"credits":3}},{"code":"ITMD 569","title":"Topics in Application Development","description":"This course will cover a particular topic in application development, varying from semester to semester, in which there is a particular student or staff interest. This course may be taken more than once but only 9 hours of ITMD 569 credit may be applied to a degree.","hours":{"credit":"variable"}}]